const gotveniJadenja = ['Летна Манџа', "Мучкалица", "Бечка шницла", "Караѓорѓева шницла", "Пилешко во сусам", "Поховано пилешко", "Гулаш", "Селско месо", "Тавче гравче", "Сарма од лоза", "Сарма од зелка", "Полнети пиперки"]
const skara = ['Телешки џигер','Јунешка шарска плескавица','Јунешка Плескавица','Јунешки ќебап','Јунешки уштипци','Ловечка плескавица','Свинска вешалица','Свинска кременадла','Свински ражнич','Свински увијач','Свеж свински колбас','Ребро','Сланина','Свинска полнета вешалица','Пилешки стек','Пилешки батак','Пилешки увијач','Пилешки ражнич','Пилешко полнето',]
const salati = ['Македонска','Шопска','Грчка','Свежа','Мимоза','Таратур','Тиквици поховани','Печена пиперка','Свежа пиперка','Салата од јајца','Компир салата','Цезар','Туршија','Кисела зелка','Пиперки во павлака']
const ladniPredjadenja = ['Сирење','Кашкавал','Кајмак','Урнебес','Кисело млеко','Пинџур','Макало','Чварки'];
const topliPredjadenja = ['Сирење на скара','Похован кашкавал','Пирошка','Похована пиперка со урда','Печурки буковка']
const corbi = ['Телешка чорба','Пилешка чорба','Шкембе чорба']
const prilozi = ['Лепиња на дрва','Нафора','Помфрит','Пекарски компир','Ориз','Пире','Шпагети','Мешано вариво']
const sendvici = ['Француски','Хамбургер']
const riba= ['Калифорниска пастрмка']
const omleti = ['Кајгана','Омлет со сирење/кашкавал','Омлет со свински врат','Омлет со печурки','Јајца на око']
const deserti = ['Палачинка со крем, банана и ореви','Палачинка со мед и ореви','Сладолед','Баклава']


var app = new Vue({
    el: "#app",
    data :{
        cookedMeals: [],
        grilledMeals : [],
        salads : [],
        coldStarters: [],
        hotStarters: [],
        soups: [],
        additions : [],
        sandwiches : [],
        omelette : [],
        fish : [],
        desserts : []
    },
    methods: {
        initialize : function() {
            this.cookedMeals = gotveniJadenja;
            this.grilledMeals = skara;
            this.salads = salati;
            this.coldStarters = ladniPredjadenja;
            this.hotStarters = topliPredjadenja;
            this.soups = corbi;
            this.additions = prilozi;
            this.sandwiches = sendvici;
            this.omelette = omleti;
            this.fish = riba;
            this.desserts = deserti;
        }
    },
    mounted() {
        this.initialize();
    }
})
